In [10]:
import pandas as pd
df=pd.read_csv("train.csv")

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [17]:
survived = df.Survived.sum()
All = df.Sex.count()
print(round(survived * 100 / All, 2))

38.38

In [27]:
pclass = df.groupby('Pclass').agg({'Pclass':'count'})
cAll = pclass.Pclass.tolist()
c1 = cAll[0]
print(round(c1*100/All, 2))

24.24

In [28]:
medi = df.Age.median()
sra = df.Age.fillna(medi).mean()
print(sra, medi)

29.36158249158249 28.0

In [30]:
data = df.dropna()
medi = df.Age.median()
sra = df.Age.mean()
print(sra, medi)

29.69911764705882 28.0

In [31]:
data[['SibSp','Parch']].corr()

          SibSp     Parch
SibSp  1.000000  0.255346
Parch  0.255346  1.000000

In [33]:
def Samaya_moya_moya(S):
    if S.find('Mr.') >= 0:
        return
    elif S.find('Miss. ') >= 0:
        ss = S.find('Miss. ')
        S = S[ss + 6:]
        cc = S.find(' ')
        
        return S[:cc]
        
    else:
        rs = S.find('(')


        S = S[rs + 1:]
        sr = S.find(' ')
        d = S[:sr]
        if d[-1] == ',':
            return d[:-1]
        else:
            return d

In [34]:
df.Name = df.Name.apply(Samaya_moya_moya)

In [35]:
df.Name = df.Name.dropna()

In [36]:
df.Name.value_counts()

Anna         12
Margaret     10
Elizabeth     9
Mary          8
Mar           6
             ..
Mathilde      1
Sigrid        1
Eliza         1
Robina        1
Kristina      1
Name: Name, Length: 247, dtype: int64